ERM/src/Documents/КорректировкаТранзакции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>КорректировкаТранзакции</Name>
			<BasedOn>
				<xr:Item>Document.ТранзакцияHOB</xr:Item>
				<xr:Item>Document.ТранзакцияOracle</xr:Item>
				<xr:Item>Document.ПроводкаDSS</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.BilledAR</xr:Item>
				<xr:Item>AccumulationRegister.Payments</xr:Item>
				<xr:Item>AccumulationRegister.UnallocatedCash</xr:Item>
				<xr:Item>AccumulationRegister.UnallocatedMemo</xr:Item>
				<xr:Item>AccumulationRegister.ManualTransactions</xr:Item>
				<xr:Item>AccumulationRegister.UnbilledAR</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПроводкаDSS</v8:Type>
						<v8:Type>cfg:DocumentRef.ТранзакцияOracle</v8:Type>
						<v8:Type>cfg:DocumentRef.ТранзакцияHOB</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Client</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Location</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SubSubSegment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Account</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Lawson</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.Oracle</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AU</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КостЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LegalEntity</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LegalEntiites</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

ERM/src/AccumulationRegisters/BilledAR.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>BilledAR</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>BaseAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Client</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Source</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСоответствий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Location</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SubSubSegment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Invoice</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Invoice</v8:Type>
						<v8:Type>cfg:DocumentRef.Memo</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Account</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Lawson</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.Oracle</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>AU</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КостЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ERM/src/AccumulationRegisters/UnbilledAR.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>UnbilledAR</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Client</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GeoMarket</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.GeoMarkets</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SubGeoMarket</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.GeoMarkets</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Segment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SalesOrder</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SalesOrder</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Account</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Lawson</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ERM/src/AccumulationRegisters/UnallocatedCash.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>UnallocatedCash</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Client</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GeoMarket</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.GeoMarkets</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SubGeoMarket</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.GeoMarkets</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Segment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SubSegment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SubSubSegment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>CashBatch</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CashBatch</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Account</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Lawson</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>AU</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КостЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ERM/src/AccumulationRegisters/UnallocatedMemo.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>UnallocatedMemo</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>BaseAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Client</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Source</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСоответствий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Location</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SubSubSegment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Memo</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Memo</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Account</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Lawson</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.Oracle</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>AU</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КостЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ERM/src/AccumulationRegisters/ManualTransactions.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>ManualTransactions</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>BaseAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Client</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GeoMarket</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.GeoMarkets</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SubGeoMarket</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.GeoMarkets</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Segment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SubSegment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SubSubSegment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РучнаяКорректировкаLawson</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Account</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Lawson</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>AU</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КостЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ERM/src/Documents/КорректировкаТранзакции/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ТранзакцияHOB") Тогда
		// Заполнение шапки
		ДокументОснование = ДанныеЗаполнения.Ссылка;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ТранзакцияOracle") Тогда
		// Заполнение шапки
		ДокументОснование = ДанныеЗаполнения.Ссылка;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПроводкаDSS") Тогда
		// Заполнение шапки
		ДокументОснование = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	РеквизитыТранзакции = Документы.КорректировкаТранзакции.ПолучитьРеквизитыТранзакции(ДокументОснование);
	Если РеквизитыТранзакции.Source = Перечисления.ТипыСоответствий.OracleSmith ИЛИ РеквизитыТранзакции.Source = Перечисления.ТипыСоответствий.OracleSmith Тогда
		Если РеквизитыТранзакции.ТранзакцияClient = Client И
				РеквизитыТранзакции.ТранзакцияAccount = Account И
				РеквизитыТранзакции.ТранзакцияCompany = Company И
				РеквизитыТранзакции.ТранзакцияLocation = Location И
				РеквизитыТранзакции.ТранзакцияSubSubSegment = SubSubSegment И
				РеквизитыТранзакции.ТранзакцияCurrency = Currency И
				РеквизитыТранзакции.ТранзакцияLegalEntity = LegalEntity Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Attributes not changed");
		КонецЕсли;
	ИначеЕсли РеквизитыТранзакции.ТранзакцияClient = Client И
				РеквизитыТранзакции.ТранзакцияAccount = Account И
				РеквизитыТранзакции.ТранзакцияCompany = Company И
				РеквизитыТранзакции.ТранзакцияLocation = Location И
				РеквизитыТранзакции.ТранзакцияSubSubSegment = SubSubSegment И
				РеквизитыТранзакции.ТранзакцияCurrency = Currency И
				РеквизитыТранзакции.ТранзакцияLegalEntity = LegalEntity И
				РеквизитыТранзакции.ТранзакцияAU = AU Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Attributes not changed");
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//ТранзакцияОбъект = ДокументОснование.ПолучитьОбъект();
	
	НЗ_BilledAR = РегистрыНакопления.BilledAR.СоздатьНаборЗаписей();
	НЗ_BilledAR.Отбор.Регистратор.Установить(ДокументОснование);
	НЗ_BilledAR.Прочитать();
	
	Если НЗ_BilledAR.Количество() > 0 Тогда
		
		ДвиженияBilledAR = Движения.BilledAR;
		
		Для Каждого Запись Из НЗ_BilledAR Цикл
			НовоеДвижениеСторно = ДвиженияBilledAR.Добавить();
			ЗаполнитьЗначенияСвойств(НовоеДвижениеСторно,Запись);
			НовоеДвижениеСторно.Период = Дата;
			НовоеДвижениеСторно.Amount = -Запись.Amount;
			НовоеДвижениеСторно.BaseAmount = -Запись.BaseAmount;
			
			НовоеДвижение = ДвиженияBilledAR.Добавить();
			ЗаполнитьЗначенияСвойств(НовоеДвижение, ЭтотОбъект);
			НовоеДвижение.Период = Дата;
			НовоеДвижение.ВидДвижения = Запись.ВидДвижения;
			НовоеДвижение.Source = Запись.Source;
			НовоеДвижение.Invoice = Запись.Invoice;
			НовоеДвижение.Amount = Запись.Amount;
			НовоеДвижение.BaseAmount = Запись.BaseAmount;
		КонецЦикла;
		
		ДвиженияBilledAR.Записывать = Истина;
		
	КонецЕсли;
	
	НЗ_UnbilledAR = РегистрыНакопления.UnbilledAR.СоздатьНаборЗаписей();
	НЗ_UnbilledAR.Отбор.Регистратор.Установить(ДокументОснование);
	НЗ_UnbilledAR.Прочитать();
	
	Если НЗ_UnbilledAR.Количество() > 0 Тогда
		
		ДвиженияUnbilledAR = Движения.UnbilledAR;
		
		Для Каждого Запись Из НЗ_UnbilledAR Цикл
			НовоеДвижениеСторно = ДвиженияUnbilledAR.Добавить();
			ЗаполнитьЗначенияСвойств(НовоеДвижениеСторно,Запись);
			НовоеДвижениеСторно.Период = Дата;
			НовоеДвижениеСторно.Amount = -Запись.Amount;
			НовоеДвижениеСторно.BaseAmount = -Запись.BaseAmount;
			
			НовоеДвижение = ДвиженияUnbilledAR.Добавить();
			ЗаполнитьЗначенияСвойств(НовоеДвижение, ЭтотОбъект);
			НовоеДвижение.Период = Дата;
			НовоеДвижение.ВидДвижения = Запись.ВидДвижения;
			НовоеДвижение.Source = Запись.Source;
			НовоеДвижение.SalesOrder = Запись.SalesOrder;
			НовоеДвижение.Amount = Запись.Amount;
			НовоеДвижение.BaseAmount = Запись.BaseAmount;
		КонецЦикла;
		
		ДвиженияUnbilledAR.Записывать = Истина;
		
	КонецЕсли;
	
	НЗ_UnallocatedCash = РегистрыНакопления.UnallocatedCash.СоздатьНаборЗаписей();
	НЗ_UnallocatedCash.Отбор.Регистратор.Установить(ДокументОснование);
	НЗ_UnallocatedCash.Прочитать();
	
	Если НЗ_UnallocatedCash.Количество() > 0 Тогда
		
		ДвиженияUnallocatedCash = Движения.UnallocatedCash;
		
		Для Каждого Запись Из НЗ_UnallocatedCash Цикл
			НовоеДвижениеСторно = ДвиженияUnallocatedCash.Добавить();
			ЗаполнитьЗначенияСвойств(НовоеДвижениеСторно,Запись);
			НовоеДвижениеСторно.Период = Дата;
			НовоеДвижениеСторно.Amount = -Запись.Amount;
			НовоеДвижениеСторно.BaseAmount = -Запись.BaseAmount;
			
			НовоеДвижение = ДвиженияUnallocatedCash.Добавить();
			ЗаполнитьЗначенияСвойств(НовоеДвижение, ЭтотОбъект);
			НовоеДвижение.Период = Дата;
			НовоеДвижение.ВидДвижения = Запись.ВидДвижения;
			НовоеДвижение.Source = Запись.Source;
			НовоеДвижение.CashBatch = Запись.CashBatch;
			НовоеДвижение.Amount = Запись.Amount;
			НовоеДвижение.BaseAmount = Запись.BaseAmount;
		КонецЦикла;
		
		ДвиженияUnallocatedCash.Записывать = Истина;
		
	КонецЕсли;
	
	НЗ_UnallocatedMemo = РегистрыНакопления.UnallocatedMemo.СоздатьНаборЗаписей();
	НЗ_UnallocatedMemo.Отбор.Регистратор.Установить(ДокументОснование);
	НЗ_UnallocatedMemo.Прочитать();
	
	Если НЗ_UnallocatedMemo.Количество() > 0 Тогда
		
		ДвиженияUnallocatedMemo = Движения.UnallocatedMemo;
		
		Для Каждого Запись Из НЗ_UnallocatedMemo Цикл
			НовоеДвижениеСторно = ДвиженияUnallocatedMemo.Добавить();
			ЗаполнитьЗначенияСвойств(НовоеДвижениеСторно,Запись);
			НовоеДвижениеСторно.Период = Дата;
			НовоеДвижениеСторно.Amount = -Запись.Amount;
			НовоеДвижениеСторно.BaseAmount = -Запись.BaseAmount;
			
			НовоеДвижение = ДвиженияUnallocatedMemo.Добавить();
			ЗаполнитьЗначенияСвойств(НовоеДвижение, ЭтотОбъект);
			НовоеДвижение.Период = Дата;
			НовоеДвижение.ВидДвижения = Запись.ВидДвижения;
			НовоеДвижение.Source = Запись.Source;
			НовоеДвижение.Memo = Запись.Memo;
			НовоеДвижение.Amount = Запись.Amount;
			НовоеДвижение.BaseAmount = Запись.BaseAmount;
		КонецЦикла;
		
		ДвиженияUnallocatedMemo.Записывать = Истина;
		
	КонецЕсли;
	
	НЗ_ManualTransactions = РегистрыНакопления.ManualTransactions.СоздатьНаборЗаписей();
	НЗ_ManualTransactions.Отбор.Регистратор.Установить(ДокументОснование);
	НЗ_ManualTransactions.Прочитать();
	
	Если НЗ_ManualTransactions.Количество() > 0 Тогда
		
		ДвиженияManualTransactions = Движения.ManualTransactions;
		
		Для Каждого Запись Из НЗ_ManualTransactions Цикл
			НовоеДвижениеСторно = ДвиженияManualTransactions.Добавить();
			ЗаполнитьЗначенияСвойств(НовоеДвижениеСторно,Запись);
			НовоеДвижениеСторно.Период = Дата;
			НовоеДвижениеСторно.Amount = -Запись.Amount;
			НовоеДвижениеСторно.BaseAmount = -Запись.BaseAmount;
			
			НовоеДвижение = ДвиженияManualTransactions.Добавить();
			ЗаполнитьЗначенияСвойств(НовоеДвижение, ЭтотОбъект);
			НовоеДвижение.Период = Дата;
			НовоеДвижение.ВидДвижения = Запись.ВидДвижения;
			НовоеДвижение.Source = Запись.Source;
			НовоеДвижение.РучнаяКорректировка = Запись.РучнаяКорректировка;
			НовоеДвижение.Amount = Запись.Amount;
			НовоеДвижение.BaseAmount = Запись.BaseAmount;
		КонецЦикла;
		
		ДвиженияManualTransactions.Записывать = Истина;
		
	КонецЕсли;
	
	НЗ_Payments = РегистрыНакопления.Payments.СоздатьНаборЗаписей();
	НЗ_Payments.Отбор.Регистратор.Установить(ДокументОснование);
	НЗ_Payments.Прочитать();
	
	Если НЗ_Payments.Количество() > 0 Тогда
		
		ДвиженияPayments = Движения.Payments;
		
		Для Каждого Запись Из НЗ_Payments Цикл
			НовоеДвижениеСторно = ДвиженияPayments.Добавить();
			ЗаполнитьЗначенияСвойств(НовоеДвижениеСторно,Запись);
			НовоеДвижениеСторно.Период = Дата;
			НовоеДвижениеСторно.Amount = -Запись.Amount;
			
			НовоеДвижение = ДвиженияPayments.Добавить();
			ЗаполнитьЗначенияСвойств(НовоеДвижение, ЭтотОбъект);
			НовоеДвижение.Период = Дата;
			НовоеДвижение.ВидДвижения = Запись.ВидДвижения;
			НовоеДвижение.Source = Запись.Source;
			НовоеДвижение.Invoice = Запись.Invoice;
			НовоеДвижение.CashBatch = Запись.CashBatch;
			НовоеДвижение.Amount = Запись.Amount;
		КонецЦикла;
		
		ДвиженияPayments.Записывать = Истина;
		
	КонецЕсли;
	
КонецПроцедуры
